Revit 2027 API
ParameterTypeId.StairsLandingStructural Property
 "Structural": Structural
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsLandingStructural { get; }
Public Shared ReadOnly Property StairsLandingStructural As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsLandingStructural {
	ForgeTypeId^ get ();
}
static member StairsLandingStructural : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace